//根据行业编码联想输入部门、职务、职业、职称

var dats = ['办公室,人事部,财务部,设备部,信息部,保卫科','总经办,生产部,技术部,品质部,采购部,销售部,外贸部,物流部','党政办,行政科,秘书科,机要科,督查科,法制科,外事办,综合科,政策研究科,监察室,后勤中心,老干部处,接待科,电子政务中心','党支部,政教处,教务处,教导处,总务处,语文教研组,英语教研组,数学教研组,科学教研组,音体美教研组,教科研处,大队部,学生处','ICU,急诊科,妇产科,儿科,内科,普外,骨科,麻醉科,心内科,肾内科,血液内科,呼吸内科,消化内科,神经内科,内分泌科,心胸外科,泌尿外科,肝胆外科,神经外科,乳腺外科,整形美容科,耳鼻喉科,眼科,口腔科,肿瘤科,皮肤科,传染科,中医科,检验科,影像科,药剂科,病理科,病案科,医教科,护理部，总务科,后勤处','业务部,信贷科,资金营运部,信贷审批部,风险管理部,合规部,计财部,内审部,监察室,法务部','总经办,市场部,客户部,策划部,制作部,编辑部,发行部','总经办,市场营销部,前厅部,客房部,餐饮部,娱乐部,采购部,后勤部,厨政部,服务部,公关部,研发部'],//通用部门、默认部门、专用部门
    posit=['主任,副主任,助理,秘书,科员,后勤,文员,会计,出纳,司机,保安,保洁','董事长,总经理,副总经理,总监,经理,科长,组长','书记,部长,副部长,局长,副局长,处长,副处长,科长,副科长','助教,教师,语文教师,英语教师,数学教师,科学教师,音乐教师,体育教师,美术教师,物理教师,化学教师,政治教师,班主任,主任,校长助理,副校长,校长','医师,麻醉师,药剂师,化验师,技师,护工,护士,护士长,副院长,院长,书记','行长,副行长,科长,信贷员,理财经理','导演,制片,摄影师,剧务,场记,灯光师,录音师,美工师,化妆师,总编,编辑,记者,通讯员','大堂经理,领班,楼层服务员,接待员,话务员,礼宾员'],//通用职务、默认职务、专用职务
titl = ['初级工,中级工,高级工,技师,高级技师,正高级技师,技术员,工程师,高级工程师,教授级高级工程师,会计员,助理会计师,会计师,高级会计师,经济员,助理经济师,经济师,高级经济师','省部正职,省部副职,厅局正职,厅局副职,县处正职,县处副职,乡科正职,乡科副职,巡视员,副巡视员,调研员,副调研员,主任科员,副主任科员,科员,办事员','教师,二级教师,一级教师,高级教师,特级教师,教员,助教,讲师,高级讲师,教授级讲师,副教授,教授,博士生导师,实习指导教师,二级实习指导员,一级实习指导员,高级实习指导员,实验员,助理实验师,实验师,高级实验师,助理研究员,副研究员,研究员','医士,医师,主治医师,副主任医师,主任医师,护士,护师,主管护师,副主任护师,主任护师,技士,技师,主管技师,副主任技师,主任技师,药士,药师,主管药师,副主任药师,主任药师','统计员,助理统计师,统计师,高级统计师,会计员,助理会计师,会计师,高级会计师,研究员级会计师,审计员,助理审计师,审计师,高级审计师,经济员,经济师,助理经济师,经济师,高级经济师,研究员级经济师','助理记者,记者,主任记者,高级记者,助理编辑,编辑,副编审,编审,演员,助理演员,三级演员,二级演员,一级演员,三级播音员,二级播音员,一级播音员,主任播音员,播音指导,三级教练,二级教练,一级教练,高级教练,国家级教练','初级导游,中级导游,高级导游,特级导游,初级厨师,中级厨师,高级厨师,技师,高级技师','技术员,推广研究员,助理农艺师,农艺师,高级农艺师,助理畜牧师,畜牧师,高级畜牧师,农经员,助理农经师,农经师,高级农经师','三副,二副,大副,船长,高级船长,三管轮,二管轮,轮机长,高级轮机长,引航员,二等引航员,一等引航员,高级引航员,飞行员,三级飞行员,二级飞行员,一级飞行员'];//通用、专用职称
function change_sele() {var indus=document.getElementById("indus0").title; 
    switch (indus.substr(0,-2)){
		case "1"://政府
            dats = dats[2]+dats[0];//部门
            posit = posit[2]+posit[0];//职务
            titl =titl[1];//职称
			break;
        case "2"://教育
            dats = dats[0]+dats[3]; posit = posit[3]+posit[0]; titl =titl[2];
            break;
        case "3"://医卫
            dats =dats[4]+dats[0]; posit = posit[4]+posit[0]; titl =titl[3];
            break;
	    case "20"://金融
            dats = dats[5]+dats[0]; posit = posit[5]+posit[0]; titl =titl[4];
            break;
        case "24"://文化娱乐
            dats = dats[6]+dats[0]; posit = posit[6]+posit[0]; titl =titl[5];
		case "25"://餐住游
            dats = dats[7]+dats[0]; posit = posit[7]+posit[0]; titl =titl[6];
            break;
        case "5"://农业
            dats = dats[1]+dats[0]; posit = posit[1]+posit[0]; titl =titl[7];
            break; 
        case "17"://物流
            dats = dats[1]+dats[0]; posit = posit[1]+posit[0]; titl =titl[8];
            break;
        default://其它
            dats = dats[1]+dats[0]; posit = posit[1]+posit[0]; titl =titl[0];
    }
    if (document.getElementById('per_dept')) {
        document.getElementById('per_dept').dataset.s = dats}
    if (document.getElementById('per_position')) {
        document.getElementById('per_position').dataset.s = posit}
    if (document.getElementById('per_job_title')) {
        document.getElementById('per_job_title').dataset.s = titl}
}
